// Написать программу вычисления произведения чисел от 1 до N
int N=4,p=1;
int count=1;

int Number (int N)
{
    return p=p*count;
}

while (count<N)
{
    count++;
    Number(N);
}
System.Console.WriteLine(p);

